RhinoInside.Revit API Documentation
ColorConverter.ToColor Method (Color)
 Converts the specified Color to an equivalent Color.
 Namespace: RhinoInside.Revit.Convert.System.Windows.Media
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8017
Syntax
public static Color ToColor(
	this Color value
)
Parameters
value
Type: Color
A value to convert.
Return Value
Type: Color
A Color that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Color. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ColorConverter Class
ToColor Overload
RhinoInside.Revit.Convert.System.Windows.Media Namespace